# Loading Data From CSV file

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("daily-total-female-births-CA.xls",header=0)

In [3]:
df.head()

         date  births
0  1959-01-01      35
1  1959-01-02      32
2  1959-01-03      30
3  1959-01-04      31
4  1959-01-05      44

In [4]:
df['date'].dtype

dtype('O')

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 365 entries, 0 to 364
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    365 non-null    object
 1   births  365 non-null    int64
dtypes: int64(1), object(1)
memory usage: 5.8+ KB

In [6]:
df2=pd.read_csv('daily-total-female-births-CA.xls',header=0,parse_dates=[0])

In [7]:
df2.head()

        date  births
0 1959-01-01      35
1 1959-01-02      32
2 1959-01-03      30
3 1959-01-04      31
4 1959-01-05      44

In [8]:
df2['date'].dtype  # <M8[ns] ek NumPy/Pandas ka data type hai jo datetime64 ko represent karta hai nanosecond precision ke sath.

dtype('<M8[ns]')

In [9]:
series=pd.read_csv('daily-total-female-births-CA.xls',header=0,parse_dates=[0],index_col=0).squeeze("columns")

In [10]:
series.head()

date
1959-01-01    35
1959-01-02    32
1959-01-03    30
1959-01-04    31
1959-01-05    44
Name: births, dtype: int64

In [11]:
series.shape

(365,)

In [12]:
df2.shape

(365, 2)

In [13]:
print(series['1959-01'])

date
1959-01-01    35
1959-01-02    32
1959-01-03    30
1959-01-04    31
1959-01-05    44
1959-01-06    29
1959-01-07    45
1959-01-08    43
1959-01-09    38
1959-01-10    27
1959-01-11    38
1959-01-12    33
1959-01-13    55
1959-01-14    47
1959-01-15    45
1959-01-16    37
1959-01-17    50
1959-01-18    43
1959-01-19    41
1959-01-20    52
1959-01-21    34
1959-01-22    53
1959-01-23    39
1959-01-24    32
1959-01-25    37
1959-01-26    43
1959-01-27    39
1959-01-28    35
1959-01-29    44
1959-01-30    38
1959-01-31    24
Name: births, dtype: int64

In [14]:
df2[(df2['date'] > '1959-01-01') & (df2['date'] <= '1959-01-21')]

         date  births
1  1959-01-02      32
2  1959-01-03      30
3  1959-01-04      31
4  1959-01-05      44
5  1959-01-06      29
6  1959-01-07      45
7  1959-01-08      43
8  1959-01-09      38
9  1959-01-10      27
10 1959-01-11      38
11 1959-01-12      33
12 1959-01-13      55
13 1959-01-14      47
14 1959-01-15      45
15 1959-01-16      37
16 1959-01-17      50
17 1959-01-18      43
18 1959-01-19      41
19 1959-01-20      52
20 1959-01-21      34

### Descriptive

In [15]:
series.describe()

count    365.000000
mean      41.980822
std        7.348257
min       23.000000
25%       37.000000
50%       42.000000
75%       46.000000
max       73.000000
Name: births, dtype: float64

In [16]:
df2.describe()

                      date      births
count                  365  365.000000
mean   1959-07-02 00:00:00   41.980822
min    1959-01-01 00:00:00   23.000000
25%    1959-04-02 00:00:00   37.000000
50%    1959-07-02 00:00:00   42.000000
75%    1959-10-01 00:00:00   46.000000
max    1959-12-31 00:00:00   73.000000
std                    NaN    7.348257

In [17]:
df2.head(5)

        date  births
0 1959-01-01      35
1 1959-01-02      32
2 1959-01-03      30
3 1959-01-04      31
4 1959-01-05      44

In [18]:
features = df2.copy()

In [19]:
features['year'] = df2['date'].dt.year

In [20]:
features['year'] = df2['date'].dt.month

In [21]:
features['year'] = df2['date'].dt.day

In [22]:
features.head(5)

        date  births  year
0 1959-01-01      35     1
1 1959-01-02      32     2
2 1959-01-03      30     3
3 1959-01-04      31     4
4 1959-01-05      44     5

### Lag features

In [23]:
features['lags2'] = df2['births'].shift(2)

In [24]:
features ['lags2'] = df2['births'].shift(365)

In [25]:
features.head(2)

        date  births  year  lags2
0 1959-01-01      35     1    NaN
1 1959-01-02      32     2    NaN

### Window features

In [26]:
features['Roll_mean'] = df2['births'].rolling(window = 2).mean()

In [30]:
features.head(100)

         date  births  year  lags2  Roll_mean
0  1959-01-01      35     1    NaN        NaN
1  1959-01-02      32     2    NaN       33.5
2  1959-01-03      30     3    NaN       31.0
3  1959-01-04      31     4    NaN       30.5
4  1959-01-05      44     5    NaN       37.5
..        ...     ...   ...    ...        ...
95 1959-04-06      33     6    NaN       34.5
96 1959-04-07      35     7    NaN       34.0
97 1959-04-08      38     8    NaN       36.5
98 1959-04-09      38     9    NaN       38.0
99 1959-04-10      34    10    NaN       36.0

[100 rows x 5 columns]